#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/businesscompanyllc/businesscompanyllc-github/runs/run-YYRvQYxsGotMBanL

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.repo_core_platform.github_repository.the_repository: Refreshing state... [id=core-platform]
module.repo_github_configuration.github_repository.the_repository: Refreshing state... [id=github-configuration]
github_team.organization_managers: Refreshing state... [id=5308184]
github_membership.user_1: Refreshing state... [id=businesscompanyllc:sarina]
github_membership.user_0: Refreshing state... [id=businesscompanyllc:kdmccormick]
github_team_membership.membership_for_user_1: Refreshing state... [id=5308184:sarina]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.test will be created
  + resource "github_repository" "test" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "for testing"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "test-repo-deleteme"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # module.repo_core_platform.github_repository.the_repository will be destroyed
  - resource "github_repository" "the_repository" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = false -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "Some core platform code and stuff" -> null
      - etag                   = "W/\"9942ea01bd4f71511e81a2eaded527336e3512cfa7fb1d1b9d9cc62ec284613d\"" -> null
      - full_name              = "businesscompanyllc-gh-config-bot/core-platform" -> null
      - git_clone_url          = "git://github.com/businesscompanyllc-gh-config-bot/core-platform.git" -> null
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/businesscompanyllc-gh-config-bot/core-platform" -> null
      - http_clone_url         = "https://github.com/businesscompanyllc-gh-config-bot/core-platform.git" -> null
      - id                     = "core-platform" -> null
      - is_template            = false -> null
      - name                   = "core-platform" -> null
      - node_id                = "R_kgDOGTNFlw" -> null
      - private                = false -> null
      - repo_id                = 422790551 -> null
      - ssh_clone_url          = "git@github.com:businesscompanyllc-gh-config-bot/core-platform.git" -> null
      - svn_url                = "https://github.com/businesscompanyllc-gh-config-bot/core-platform" -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

  # module.repo_github_configuration.github_repository.the_repository will be destroyed
  - resource "github_repository" "the_repository" {
      - allow_auto_merge       = true -> null
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archive_on_destroy     = false -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - default_branch         = "main" -> null
      - delete_branch_on_merge = true -> null
      - description            = "GitHub organization configuration-as-code, includinging permissions, teams, and repositories." -> null
      - etag                   = "W/\"ffc6a64a5eaa2ec27020cd817a3eada1880233fdd95682d372cb79bb43f230f5\"" -> null
      - full_name              = "businesscompanyllc-gh-config-bot/github-configuration" -> null
      - git_clone_url          = "git://github.com/businesscompanyllc-gh-config-bot/github-configuration.git" -> null
      - has_downloads          = false -> null
      - has_issues             = false -> null
      - has_projects           = false -> null
      - has_wiki               = false -> null
      - html_url               = "https://github.com/businesscompanyllc-gh-config-bot/github-configuration" -> null
      - http_clone_url         = "https://github.com/businesscompanyllc-gh-config-bot/github-configuration.git" -> null
      - id                     = "github-configuration" -> null
      - is_template            = false -> null
      - name                   = "github-configuration" -> null
      - node_id                = "R_kgDOGTNBYA" -> null
      - private                = false -> null
      - repo_id                = 422789472 -> null
      - ssh_clone_url          = "git@github.com:businesscompanyllc-gh-config-bot/github-configuration.git" -> null
      - svn_url                = "https://github.com/businesscompanyllc-gh-config-bot/github-configuration" -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = true -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.


```

</details>

*Pusher: @kdmccormick, Action: `pull_request`*